app/controllers/books_controller.rb

  def show
  	@book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
  	@book = current_user.books.build(book_params)
  	@book.user_id = current_user.id
  	if @book.save
  		flash[:notice] = "You have created book successfully."
  		redirect_to book_path(@book.id)
  	else
   		@user = current_user
   		@books = Book.all.order(created_at: :desc)
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "title_a"], ["body", "body_b"], ["created_at", "2019-05-29 23:08:56.528952"], ["updated_at", "2019-05-29 23:08:56.528952"], ["user_id", 1]]
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC

  def index
  	@books = Book.all.order(created_at: :desc)
---
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC

  def edit
  	@book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
  	@book = Book.find(params[:id])
  	if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "update_title_a"], ["body", "update_body_b"], ["updated_at", "2019-05-29 23:08:56.948455"], ["id", 1]]

  def destroy
  	book = Book.find(params[:id])
  	book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]