app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
  	@users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
  	@user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
  	@user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
  def update
  	@user = User.find(params[:id])
  	if @user.update(user_params)